{
    "properties": [
        {
            "id": 1,
            "estate_title": "Luxury Beachfront Villa",
            "segment_name": "Villa",
            "description": "Escape to paradise with this stunning luxury beachfront villa. Situated along the pristine shores of Mauna Kea Beach, this magnificent estate offers the ultimate in tropical living. Step through the grand entrance and into a world of luxury, where vaulted ceilings, travertine floors, and panoramic ocean views create an atmosphere of refined elegance. The spacious living areas are perfect for entertaining, with a gourmet kitchen, formal dining room, and expansive lanai overlooking the turquoise waters of the Pacific. Retreat to one of six luxurious bedroom suites, each with its own ensuite bath and private lanai, offering unparalleled comfort and privacy. Outside, the lushly landscaped grounds feature a sparkling infinity pool, hot tub, and outdoor kitchen, creating the perfect setting for al fresco dining and sunset cocktails. With access to world-class amenities including golf, tennis, and spa services at the nearby Mauna Kea Resort, this beachfront villa offers a truly unparalleled lifestyle.",
            "price": 10000000,
            "status": "sale",
            "area": "8000 sq ft",
            "location": "Mauna Kea Beach, Hawaii, USA",
            "facilities": [
                "Beachfront location",
                "Infinity pool",
                "Hot tub",
                "Gourmet kitchen"
            ],
            "image_url": "https://i.ibb.co/NtFY0HW/pexels-eric-prouzet-15334538.jpg",
            "view_property_url": "https://i.ibb.co/HCS0Ytz/pexels-eric-prouzet-15334541.jpg"
        },
        {
            "id": 2,
            "estate_title": "Mountain View Retreat",
            "segment_name": "Cabin",
            "description": "Experience the beauty of the Rocky Mountains with this charming mountain view retreat. Nestled amidst towering pine trees and sweeping vistas, this cozy cabin offers the perfect blend of rustic charm and modern convenience. Step inside and be greeted by a warm and inviting interior, with exposed wood beams, stone fireplace, and large picture windows that frame breathtaking views of the surrounding peaks. The open-concept living area is ideal for gatherings, with a fully equipped kitchen, dining area, and comfortable seating around the fireplace. Relax on the spacious deck and take in the fresh mountain air, or explore the nearby hiking trails and scenic overlooks. Whether you're seeking adventure or relaxation, this mountain retreat offers the perfect escape from the hustle and bustle of everyday life.",
            "price": 500000,
            "status": "sale",
            "area": "2500 sq ft",
            "location": "Aspen, Colorado, USA",
            "facilities": [
                "Mountain views",
                "Stone fireplace",
                "Outdoor deck",
                "Hiking trails nearby"
            ],
            "image_url": "https://i.ibb.co/TvZYt3n/istockphoto-157580921-612x612.jpg",
            "view_property_url": "https://i.ibb.co/D9Rm5Dx/istockphoto-155443116-612x612.jpg"
        },
        {
            "id": 3,
            "estate_title": "Historic Downtown Hotel",
            "segment_name": "Hotel",
            "description": "Step back in time with this historic downtown hotel, located in the heart of Charleston's historic district. Housed in a beautifully restored 19th-century building, this boutique hotel offers a unique blend of old-world charm and modern luxury. The elegant lobby welcomes guests with its soaring ceilings, crystal chandeliers, and period furnishings, while the guest rooms and suites exude warmth and sophistication with their plush bedding, antique accents, and modern amenities. Indulge in Southern hospitality at the hotel's acclaimed restaurant, where award-winning chefs serve up Lowcountry classics with a contemporary twist. After a day of exploring Charleston's cobblestone streets and historic landmarks, unwind with a cocktail at the rooftop bar, which offers panoramic views of the city skyline and harbor. With its prime location, luxurious accommodations, and impeccable service, this historic hotel offers an unforgettable experience for guests seeking to immerse themselves in Charleston's rich history and culture.",
            "price": 8000000,
            "status": "sale",
            "area": "12000 sq ft",
            "location": "Charleston, South Carolina, USA",
            "facilities": [
                "Historic building",
                "Award-winning restaurant",
                "Rooftop bar",
                "Concierge service"
            ],
            "image_url": "https://i.ibb.co/gVMxXHh/Hotel.jpg",
            "view_property_url": "https://i.ibb.co/jH8yFsg/Hotel-View.jpg"
        },
        {
            "id": 4,
            "estate_title": "Lakefront Resort & Spa",
            "segment_name": "Resort",
            "description": "Experience lakeside luxury at this exclusive resort and spa, nestled along the shores of Lake Tahoe. Surrounded by towering pines and crystal-clear waters, this idyllic retreat offers the perfect blend of relaxation and adventure. Guests can unwind in the resort's luxurious accommodations, which feature plush bedding, marble bathrooms, and stunning views of the lake and mountains. The resort's spa offers a range of rejuvenating treatments, including massages, facials, and body wraps, while the fitness center provides state-of-the-art equipment and expert personal trainers. Outside, guests can enjoy a variety of recreational activities, including kayaking, paddleboarding, and hiking, or simply relax by the resort's outdoor pool and hot tub. With its serene setting, world-class amenities, and impeccable service, this lakefront resort offers an unforgettable escape for guests seeking to unwind and recharge in the beauty of Lake Tahoe.",
            "price": 12000000,
            "status": "sale",
            "area": "15000 sq ft",
            "location": "Lake Tahoe, California, USA",
            "facilities": [
                "Lakefront location",
                "Spa and wellness center",
                "Outdoor pool",
                "Fitness center"
            ],
            "image_url": "https://i.ibb.co/7pVYL96/pexels-photo.jpg",
            "view_property_url": "https://i.ibb.co/n3kcWx0/pexels.jpg"
        },
        {
            "id": 5,
            "estate_title": "Coastal Bed and Breakfast",
            "segment_name": "B&B",
            "description": "Escape to the coast with this charming bed and breakfast, located in the heart of Cape Cod. Housed in a beautifully restored 19th-century Victorian mansion, this boutique inn offers a peaceful retreat for guests seeking relaxation and romance. Each of the inn's guest rooms and suites is elegantly appointed with antique furnishings, plush bedding, and modern amenities, while the common areas feature cozy seating areas, crackling fireplaces, and stunning views of the surrounding gardens and coastline. Wake up to the smell of freshly brewed coffee and enjoy a delicious homemade breakfast served in the inn's sunny dining room or on the outdoor patio overlooking the ocean. With its prime location, luxurious accommodations, and warm hospitality, this coastal bed and breakfast offers an unforgettable experience for guests seeking to explore the natural beauty and charm of Cape Cod.",
            "price": 2500000,
            "status": "sale",
            "area": "6000 sq ft",
            "location": "Cape Cod, Massachusetts, USA",
            "facilities": [
                "Victorian mansion",
                "Ocean views",
                "Homemade breakfast",
                "Garden patio"
            ],
            "image_url": "https://i.ibb.co/3h1mfKv/B-B.jpg" ,
            "view_property_url": "https://i.ibb.co/5sbSJp6/B-BP.webp"
        },
        {
            "id": 6,
            "estate_title": "Ski-In/Ski-Out Chalet",
            "segment_name": "Chalet",
            "description": "Experience the ultimate alpine getaway with this luxurious ski-in/ski-out chalet in the heart of the French Alps. Nestled amidst snow-capped peaks and pristine slopes, this exquisite retreat offers the perfect blend of comfort and convenience for discerning travelers. Step inside and be greeted by a warm and inviting interior, with rustic wood beams, stone accents, and panoramic views of the surrounding mountains. The spacious living area is ideal for entertaining, with a cozy fireplace, comfortable seating, and a gourmet kitchen where you can whip up delicious meals after a day on the slopes. Retreat to one of the chalet's luxurious bedrooms, each with its own ensuite bath and plush bedding, ensuring a restful night's sleep after a day of adventure. Outside, the expansive deck beckons for relaxation, with a private hot tub where you can soak sore muscles and savor the crisp mountain air. With its prime location, luxurious accommodations, and unparalleled access to the slopes, this ski chalet offers an unforgettable mountain escape for guests seeking the ultimate in alpine luxury.",
            "price": 5000000,
            "status": "sale",
            "area": "4000 sq ft",
            "location": "Courchevel, French Alps",
            "facilities": [
                "Ski-in/ski-out access",
                "Hot tub",
                "Fireplace",
                "Mountain views"
            ],
            "image_url": "https://i.ibb.co/sv2Ks8v/calet.jpg",
            "view_property_url": "https://i.ibb.co/bgkJ4tV/Calet.jpg"
        }
    ]
}